#pragma once

// =============================================================================
// ИДЕНТИФИКАТОРЫ ЛОГИЧЕСКИХ ЭКРАНОВ (SCREENS)
// Используются для переключения между режимами отображения
// =============================================================================ыW
typedef enum {
    SCREEN_LIST,            // Главный экран
    SCREEN_IR_TEST,         // Тест ИК-передатчиков
    SCREEN_ENCODER_TEST,    // Тест энкодеров
    SCREEN_SETTINGS,        // Меню настроек
    SCREEN_BACKLIGHT_EDIT,  // Меню редактирования яркости дисплея
    SCREEN_DIAGNOSTICS,     // Диагностическая информация
    SCREEN_BUTTONS_TEST,    // Диагностика кнопок
    SCREEN_ABOUT,           // Информация о системе
    SCREEN_COUNT            // Количество экранов (не использовать как экран)
} ScreenId;
